tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "romkatv/powerlevel10k"
brew "act"
brew "autoconf"
brew "automake"
brew "node"
brew "aws-cdk"
brew "awscli"
brew "awslogs"
brew "bash-completion"
brew "binutils"
brew "cloudflared"
brew "coreutils"
brew "diffutils"
brew "docker-completion", link: false
brew "docker-compose", link: false
brew "dog"
brew "ffmpeg"
brew "findutils"
brew "gawk"
brew "gcc"
brew "gh"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-which"
brew "go"
brew "grep"
brew "gzip"
brew "htop"
brew "imagemagick"
brew "inetutils"
brew "jq"
brew "kubernetes-cli"
brew "lsof"
brew "make"
brew "mas"
brew "minikube"
brew "mitmproxy"
brew "mkcert"
brew "moreutils"
brew "mysql"
brew "mysql-client"
brew "nano"
brew "nanorc"
brew "nkf"
brew "nmap"
brew "nvm"
brew "openjdk"
brew "p7zip"
brew "perl"
brew "php"
brew "pipenv"
brew "progress"
brew "rbenv"
brew "rclone"
brew "rust"
brew "sl"
brew "sshuttle"
brew "stubby", restart_service: true
brew "subversion"
brew "terraform"
brew "tldr"
brew "tmux"
brew "tree"
brew "w3m"
brew "yarn"
brew "zplug"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-fast-syntax-highlighting"
brew "romkatv/powerlevel10k/powerlevel10k"
cask "1password-beta"
cask "alfred"
cask "android-file-transfer"
cask "android-platform-tools"
cask "android-sdk"
cask "appcleaner"
cask "audacity"
cask "chrome-remote-desktop-host"
cask "clipy"
cask "discord"
cask "discord-canary"
cask "docker"
cask "firefox"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
cask "gimp"
cask "github"
cask "google-chrome"
cask "google-chrome-beta"
cask "google-cloud-sdk"
cask "google-drive"
cask "gpg-suite"
cask "imageoptim"
cask "iterm2"
cask "jetbrains-toolbox"
cask "keka"
cask "keybase"
cask "keyboardcleantool"
cask "mono-mdk-for-visual-studio"
cask "ngrok"
cask "onedrive"
cask "parallels"
cask "parsec"
cask "postman"
cask "powershell"
cask "raspberry-pi-imager"
cask "slack"
cask "spotify"
cask "steam"
cask "unity-hub"
cask "visual-studio"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "zoom"
mas "Apple Configurator", id: 1037126344
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Playgrounds", id: 1496833156
mas "Shazam", id: 897118787
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
