tap "arrow2nd/tap"
tap "ci7lus/miraktest"
tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "k1low/tap"
tap "minacle/chntpw"
tap "reviewdog/tap"
tap "romkatv/powerlevel10k"
# Run your GitHub Actions locally 🚀
brew "act"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Access Log Profiler
brew "alp"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Platform built on V8 to build network applications
brew "node"
# AWS Cloud Development Kit - framework for defining AWS infra as code
brew "aws-cdk"
# Official Amazon AWS command-line interface
brew "awscli"
# Simple command-line tool to read AWS CloudWatch logs
brew "awslogs"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU binary tools for native development
brew "binutils"
# New way to see and navigate directory trees
brew "broot"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Open source suite of directory software
brew "openldap"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# File comparison utilities
brew "diffutils"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion", link: false
# Isolated development environments using Docker
brew "docker-compose"
# Command-line DNS client
brew "dog"
# Simple, fast and user-friendly alternative to find
brew "fd"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GNU grep, egrep and fgrep
brew "grep"
# Next generation open source RPC library and framework
brew "grpc"
# Popular GNU data compression program
brew "gzip"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# GNU utilities for networking
brew "inetutils"
# DevTools proxy for iOS devices
brew "ios-webkit-debug-proxy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Utility to list open files
brew "lsof"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Minimalist GNU for Windows and GCC cross-compilers
brew "mingw-w64"
# Run a Kubernetes cluster locally
brew "minikube"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql-client"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Improved Nano Syntax Highlighting Files
brew "nanorc"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Reverse proxy for authenticating users via OAuth 2 providers
brew "oauth2_proxy"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Command-line tools for MySQL, MariaDB and system tasks
brew "percona-toolkit"
# Highly capable, feature-rich programming language
brew "perl"
# General-purpose scripting language
brew "php"
# Python dependency management tool
brew "pipenv"
# Coreutils progress viewer
brew "progress"
# Ruby version manager
brew "rbenv"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Display and control your Android device
brew "scrcpy"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Version control system designed to be a better CVS
brew "subversion"
# Graphical network analyzer and capture tool
brew "wireshark", link: false
# Terminal UI for tshark, inspired by Wireshark
brew "termshark"
# Tool to build, change, and version infrastructure
brew "terraform"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Pager/text based browser
brew "w3m"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Automatic workarounds for problems in Wine
brew "winetricks"
# Linter for YAML files
brew "yamllint"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# TUI Twitter client 🐈
brew "arrow2nd/tap/nekome"
# tbls is a CI-Friendly tool for document a database, written in Go.
brew "k1low/tap/tbls"
# The Offline NT Password Editor
brew "minacle/chntpw/chntpw"
# Automated code review tool integrated with any code analysis tools regardless of programming language.
brew "reviewdog/tap/reviewdog"
# A Zsh Theme
brew "romkatv/powerlevel10k/powerlevel10k"
# Password manager that keeps all passwords secure behind one password
cask "1password-beta"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Stand alone ad blocker
cask "adguard"
# Application launcher and productivity software
cask "alfred"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
cask "android-sdk"
# Inspect application bundles
cask "apparency"
# Application uninstaller
cask "appcleaner"
# Multi-track audio editor and recorder
cask "audacity"
# Installer for BetterDiscord
cask "betterdiscord-installer"
# Virtual Audio Driver
cask "blackhole-2ch"
# 3D creation suite
cask "blender"
# Missing menulet for Homebrew
cask "brewlet"
# Remotely access another computer through the Google Chrome browser
cask "chrome-remote-desktop-host"
# Clipboard extension app
cask "clipy"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# Voice and text chat software
cask "discord"
# Voice and text chat software
cask "discord-canary"
# Voice and text chat software
cask "discord-ptb"
# App to build and share containerized applications and microservices
cask "docker"
# Launcher for *Epic Games* games
cask "epic-games"
# Web browser
cask "firefox"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
# Software reverse engineering (SRE) suite of tools
cask "ghidra"
# Free and open-source image editor
cask "gimp"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome-beta"
# Web browser
cask "google-chrome-canary"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Client for the Google Drive storage service
cask "google-drive"
# Tools to protect your emails and files
cask "gpg-suite"
# GraphQL IDE for better development workflows
cask "graphql-playground"
# Utility to hide menu bar items
cask "hiddenbar"
# Free and open-source media player
cask "iina"
# Avalonia-based .NET decompiler
cask "ilspy"
# Tool to optimize images to a smaller size
cask "imageoptim"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# File archiver
cask "keka"
# End-to-end encryption software
cask "keybase"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Kubernetes IDE
cask "lens"
# Create digital art and comics
cask "medibangpaintpro"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Office suite
cask "microsoft-office"
# Implementation study of digital television viewing application for Mirakurun
cask "miraktest"
# Open source implementation of Microsoft's .NET Framework
cask "mono-mdk-for-visual-studio"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Desktop virtualization software
cask "parallels"
# Remote desktop
cask "parsec"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# MongoDB management tool
cask "robo-3t"
# MySQL/MariaDB database management
cask "sequel-ace"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# All-in-one live streaming software
cask "streamlabs-obs"
# Web browser focusing on security
cask "tor-browser"
# Management tool for Unity
cask "unity-hub"
# Virtual machines UI using QEMU
cask "utm"
# Integrated development environment
cask "visual-studio"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Compatibility layer to run Windows applications
cask "wine-crossover"
# Network protocol analyzer
cask "wireshark"
# Video communication and virtual meeting platform
cask "zoom"
mas "Apple Configurator", id: 1037126344
mas "Developer", id: 640199958
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LadioCast", id: 411213048
mas "LINE", id: 539883307
mas "Monosnap", id: 540348655
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Playgrounds", id: 1496833156
mas "Shazam", id: 897118787
mas "Speedtest", id: 1153157709
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
