tap "apple/apple"
tap "arrow2nd/tap"
tap "buildpacks/tap"
tap "ci7lus/miraktest"
tap "fujiwara/tap"
tap "gcenx/wine"
tap "getsentry/tools"
tap "gromgit/fuse"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "k1low/tap"
tap "kayac/tap"
tap "ktr0731/evans"
tap "mackerelio/mackerel-agent"
tap "minacle/chntpw"
tap "motemen/furoshiki2"
tap "potatolabs/git-redate"
tap "reviewdog/tap"
tap "romkatv/powerlevel10k"
tap "teamookla/speedtest"
tap "yudai/gotty"
# Run your GitHub Actions locally
brew "act"
# Static checker for GitHub Actions workflow files
brew "actionlint"
# Access Log Profiler
brew "alp"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Download with resuming and segmented downloading
brew "aria2"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Platform built on V8 to build network applications
brew "node"
# AWS Cloud Development Kit - framework for defining AWS infra as code
brew "aws-cdk"
# Official Amazon AWS command-line interface
brew "awscli"
# Simple command-line tool to read AWS CloudWatch logs
brew "awslogs"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU binary tools for native development
brew "binutils"
# New way to see and navigate directory trees
brew "broot"
# Core application library for C
brew "glib"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# OpenType text shaping engine
brew "harfbuzz"
# Development kit for the Java programming language
brew "openjdk"
# Command-line tool to manipulate Android App Bundles
brew "bundletool"
# Extract files from Microsoft cabinet files
brew "cabextract"
# Perl module dependency manager (aka Bundler for Perl)
brew "carton"
# Define k8s native apps and abstractions using object-oriented programming
brew "cdk8s"
# CD/DVD/Blu-ray premastering and recording software
brew "cdrtools"
# CLI tool for Cloudflare Workers
brew "cloudflare-wrangler"
# Cloudflare Tunnel client (formerly Argo Tunnel)
brew "cloudflared"
# Cross-platform make
brew "cmake"
# Color-highlighted diff(1) output
brew "colordiff"
# Package acting as bridge between Node projects and their package managers
brew "corepack"
# Open source suite of directory software
brew "openldap"
# Tool for downloading RTMP streaming media
brew "rtmpdump"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# File comparison utilities
brew "diffutils"
# Bash, Zsh and Fish completion for Docker
brew "docker-completion"
# Isolated development environments using Docker
brew "docker-compose"
# Command-line DNS client
brew "dog"
# AST-based pattern checker for JavaScript
brew "eslint"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Firebase command-line tools
brew "firebase-cli"
# GNU awk utility
brew "gawk"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Remote repository management made easy
brew "ghq"
# Distributed revision control system
brew "git"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Audit git repos for secrets
brew "gitleaks"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# GNU version of the tar archiving utility
brew "gnu-tar"
# GNU implementation of which utility
brew "gnu-which"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Fast linters runner for Go
brew "golangci-lint"
# Go Language's command-line interface for database migrations
brew "goose"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# GNU grep, egrep and fgrep
brew "grep"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Next generation open source RPC library and framework
brew "grpc"
# Like cURL, but for gRPC
brew "grpcurl"
# Popular GNU data compression program
brew "gzip", link: false
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Image loading and rendering library
brew "imlib2"
# GNU utilities for networking
brew "inetutils"
# DevTools proxy for iOS devices
brew "ios-webkit-debug-proxy"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Tool to move from `docker-compose` to Kubernetes
brew "kompose"
# Static analysis tool for Kubernetes YAML files and Helm charts
brew "kube-linter"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Postgres C API library
brew "libpq"
# Fully functional local AWS cloud stack
brew "localstack"
# Utility to list open files
brew "lsof"
# Utility for directing compilation
brew "make"
# Mac App Store command-line interface
brew "mas"
# Minimalist GNU for Windows and GCC cross-compilers
brew "mingw-w64"
# Intercept, modify, replay, save HTTP/S traffic
brew "mitmproxy"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Collection of tools that nobody wrote when UNIX was young
brew "moreutils"
# Open source relational database management system
brew "mysql"
# Open source relational database management system
brew "mysql-client"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Improved Nano Syntax Highlighting Files
brew "nanorc"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Netlify command-line tool
brew "netlify-cli"
# Network Kanji code conversion Filter (NKF)
brew "nkf"
# Port scanning utility for large networks
brew "nmap"
# Libraries for security-enabled client and server applications
brew "nss"
# Manage multiple Node.js versions
brew "nvm"
# Reverse proxy for authenticating users via OAuth 2 providers
brew "oauth2_proxy"
# 7-Zip (high compression file archiver) implementation
brew "p7zip"
# Command-line tool to generate, analyze, convert and manipulate colors
brew "pastel"
# Command-line tools for MySQL, MariaDB and system tasks
brew "percona-toolkit"
# General-purpose scripting language
brew "php"
# Python dependency management tool
brew "pipenv"
# Perl binary manager
brew "plenv"
# Python package management tool
brew "poetry", link: false
# Theme for zsh
brew "powerlevel10k"
# Code formatter for JavaScript, CSS, JSON, GraphQL, Markdown, YAML
brew "prettier"
# Coreutils progress viewer
brew "progress"
# Go support for Google's protocol buffers
brew "protoc-gen-go"
# Protoc plugin that generates code for gRPC-Go clients
brew "protoc-gen-go-grpc"
# Protoc plugin that generates code for gRPC-Web clients
brew "protoc-gen-grpc-web"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Ruby version manager
brew "rbenv"
# Rsync for cloud storage
brew "rclone"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Display and control your Android device
brew "scrcpy"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Proxy server that works as a poor man's VPN
brew "sshuttle"
# Tail multiple Kubernetes pods & their containers
brew "stern", link: false
# Modern CSS linter
brew "stylelint"
# Version control system designed to be a better CVS
brew "subversion"
# Graphical network analyzer and capture tool
brew "wireshark", link: false
# Terminal UI for tshark, inspired by Wireshark
brew "termshark"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Command-line interface for Vercel
brew "vercel-cli"
# Next generation frontend tooling. It's fast!
brew "vite"
# Pager/text based browser
brew "w3m"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# Automatic workarounds for problems in Wine
brew "winetricks"
# Linter for YAML files
brew "yamllint"
# Tool for managing your YubiKey configuration
brew "ykman"
# Download YouTube videos from the command-line
brew "youtube-dl"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Fork of youtube-dl with additional features and fixes
brew "yt-dlp", link: false
# Next-generation plugin manager for zsh
brew "zplug"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Feature-rich syntax highlighting for Zsh
brew "zsh-fast-syntax-highlighting"
# TUI Twitter client 🐈
brew "arrow2nd/tap/nekome"
# A CLI for building apps using Cloud Native Buildpacks
brew "buildpacks/tap/pack"
# lambroll is a minimal deployment tool for AWS Lambda.
brew "fujiwara/tap/lambroll"
# Sentry command-line client for some generic tasks
brew "getsentry/tools/sentry-cli"
# File system client based on SSH File Transfer Protocol
brew "gromgit/fuse/sshfs-mac"
# tbls is a CI-Friendly tool for document a database, written in Go.
brew "k1low/tap/tbls"
# ecspresso is a deployment tool for Amazon ECS
brew "kayac/tap/ecspresso"
# Evans: more expressive universal gRPC client
brew "ktr0731/evans/evans"
brew "mackerelio/mackerel-agent/mackerel-agent"
# The Offline NT Password Editor
brew "minacle/chntpw/chntpw"
brew "motemen/furoshiki2/furoshiki2", args: ["HEAD"]
# Change the dates of several git commits with a single command
brew "potatolabs/git-redate/git-redate"
# Automated code review tool integrated with any code analysis tools regardless of programming language.
brew "reviewdog/tap/reviewdog"
# Ookla Speedtest
brew "teamookla/speedtest/speedtest"
# Password manager
cask "1password-beta"
# Command-line interface for 1Password
cask "1password-cli"
# Stand alone ad blocker
cask "adguard"
# Application launcher and productivity software
cask "alfred"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Android SDK component
cask "android-platform-tools"
# Tools for the Android SDK
cask "android-sdk"
# Inspect application bundles
cask "apparency"
# Application uninstaller
cask "appcleaner"
# Manage team projects and tasks
cask "asana"
# Multi-track audio editor and recorder
cask "audacity"
# Managed client-based VPN service to securely access AWS resources
cask "aws-vpn-client"
# Installer for BetterDiscord
cask "betterdiscord-installer"
# Virtual Audio Driver
cask "blackhole-16ch"
# Virtual Audio Driver
cask "blackhole-2ch"
# 3D creation suite
cask "blender"
# Monitors common persistence locations
cask "blockblock"
# Missing menulet for Homebrew
cask "brewlet"
# Clipboard extension app
cask "clipy"
# Free app that makes your Internet safer
cask "cloudflare-warp"
# OpenJDK distribution from Amazon
cask "corretto"
# Disk space visualizer
cask "daisydisk"
# Presentations from Markdown
cask "deckset"
# Trains AIs to understand and translate texts
cask "deepl"
# Voice and text chat software
cask "discord"
# Voice and text chat software
cask "discord-ptb"
# App to build and share containerized applications and microservices
cask "docker"
# Developer platform
cask "dotnet-sdk"
# Online diagram software
cask "drawio"
# Launcher for *Epic Games* games
cask "epic-games"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-source-code-pro"
cask "font-source-sans-pro"
cask "font-source-serif-pro"
# Twitter Unicode emoji color OpenType-SVG font
cask "font-twitter-color-emoji"
# Virtual video-calling space
cask "gather"
# Software reverse engineering (SRE) suite of tools
cask "ghidra"
# Free and open-source image editor
cask "gimp"
# Desktop client for GitHub repositories
cask "github"
# App that shows GitHub notifications on the desktop
cask "gitify"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
# Client for the Google Drive storage service
cask "google-drive"
# Japanese input software
cask "google-japanese-ime"
# GraphQL IDE for better development workflows
cask "graphql-playground"
# Hex editor focussing on speed
cask "hex-fiend"
# Utility to hide menu bar items
cask "hiddenbar"
# Free and open-source media player
cask "iina"
# Avalonia-based .NET decompiler
cask "ilspy"
# Tool to optimize images to a smaller size
cask "imageoptim"
# HTTP and GraphQL Client
cask "insomnia"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# JetBrains tools manager
cask "jetbrains-toolbox"
# Real-time earthquake monitoring software for Japan
cask "jquake"
# Keyboard customizer
cask "karabiner-elements"
# File archiver
cask "keka"
# End-to-end encryption software
cask "keybase"
# Blocks all Keyboard and TouchBar input
cask "keyboardcleantool"
# Interface for reading and syncing eBooks
cask "kindle"
# Kubernetes IDE
cask "lens"
# Open-source firewall to block unknown outgoing connections
cask "lulu"
# File system integration
cask "macfuse"
# Create digital art and comics
cask "medibangpaintpro"
# Shows the next meeting in the menu bar
cask "meetingbar"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Office suite
cask "microsoft-office"
# Implementation study of digital television viewing application for Mirakurun
cask "miraktest"
# Open source implementation of Microsoft's .NET Framework
cask "mono-mdk-for-visual-studio"
# Visual tool to design, develop and administer MySQL servers
cask "mysqlworkbench"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Client-side GUI application for modern database development and operations
cask "nosql-workbench"
# Open-source software for live streaming and screen recording
cask "obs"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Monitors computer mic and webcam
cask "oversight"
# Desktop virtualization software
cask "parallels"
# Remote desktop
cask "parsec"
# Administration and development platform for PostgreSQL
cask "pgadmin4"
# Collaboration platform for API development
cask "postman"
# Command-line shell and scripting language
cask "powershell"
# HTTP client that helps testing and describing APIs
cask "rapidapi"
# Imaging utility to install operating systems to a microSD card
cask "raspberry-pi-imager"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# MongoDB management tool
cask "robo-3t"
# File sharing app
cask "send-anywhere"
# MySQL/MariaDB database management
cask "sequel-ace"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# DBMS-independent SQL query tool
cask "sqlworkbenchj"
# System monitor for the menu bar
cask "stats"
# Video game digital distribution service
cask "steam"
# All-in-one live streaming software
cask "streamlabs-obs"
# Messaging app with a focus on speed and security
cask "telegram"
# Web browser focusing on security
cask "tor-browser"
# Management tool for Unity
cask "unity-hub"
# Virtual machines UI using QEMU
cask "utm"
# Integrated development environment
cask "visual-studio"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Shows a files cryptographic signing information
cask "whatsyoursign"
# Compatibility layer to run Windows applications
cask "wine-crossover"
# Network protocol analyzer
cask "wireshark"
# Video communication and virtual meeting platform
cask "zoom"
mas "Apple Configurator", id: 1037126344
mas "AS Timer", id: 512464723
mas "Developer", id: 640199958
mas "EasyRes", id: 688211836
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "LadioCast", id: 411213048
mas "LINE", id: 539883307
mas "Monosnap", id: 540348655
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Playgrounds", id: 1496833156
mas "Shazam", id: 897118787
mas "Speedtest", id: 1153157709
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Xcode", id: 497799835
